app/Controllers/Admin/UserController.php

   public function manageUsers()
   {
      $data = [
         'title' => 'Manajemen User',
         'users' => $this->userModel->findAll()
---
SELECT *
FROM `users`

   public function store()
   {
      $rules = [
         'username' => 'required|is_unique[users.username]|min_length[3]',
         'password' => 'required|min_length[6]',
         'nama_lengkap' => 'required',
         'email' => 'required|valid_email|is_unique[users.email]',
         'level' => 'required|in_list[admin,sekretaris,kepala_desa,bendahara]'
      ];

      if (!$this->validate($rules)) {
         return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
      }

      $data = [
         'username' => $this->request->getPost('username'),
         'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
         'nama_lengkap' => $this->request->getPost('nama_lengkap'),
         'email' => $this->request->getPost('email'),
         'level' => $this->request->getPost('level'),
         'is_active' => 1
      ];


      $this->userModel->save($data);
---
INSERT INTO `users` (`username`, `password`, `nama_lengkap`, `email`, `level`, `is_active`, `created_at`, `updated_at`) VALUES ('kades', '$2y$10$tkRLf0euyJrEvJUTF0qQ3uXwC.3Ojop5lzNoz/JtlnFY4OCml.l6q', 'the yellow flash', 'hokage4th@gmail.com', 'kepala_desa', 1, '2025-07-01 04:55:48', '2025-07-01 04:55:48')