app/Controllers/Bendahara/Dashboard.php

SELECT SUM(`jumlah`) AS `jumlah`
FROM `keuangan`
WHERE `jenis` = 'pemasukan'
 LIMIT 1
SELECT SUM(`jumlah`) AS `jumlah`
FROM `keuangan`
WHERE `jenis` = 'pengeluaran'
 LIMIT 1
SELECT *
FROM `keuangan`
ORDER BY `tanggal` DESC
 LIMIT 5
---
    public function index()
    {
        // Cek session dan level user
        if (!session()->get('isLoggedIn') || session()->get('level') !== 'bendahara') {
            return redirect()->to('/login');
        }

        // Hitung total pemasukan dan pengeluaran
        $totalPemasukan = $this->keuanganModel
            ->where('jenis', 'pemasukan')
            ->selectSum('jumlah')
            ->first()['jumlah'] ?? 0;

        $totalPengeluaran = $this->keuanganModel
            ->where('jenis', 'pengeluaran')
            ->selectSum('jumlah')
            ->first()['jumlah'] ?? 0;

        $saldoAkhir = $totalPemasukan - $totalPengeluaran;

        // Ambil 5 transaksi terbaru
        $transaksiTerbaru = $this->keuanganModel
            ->orderBy('tanggal', 'DESC')
            ->findAll(5);